{
  "backend/main.mo": "Motoko backend actor implementing authentication, access control, label configs, printers, prefix counters, and print/error logging with session-based password auth.",
  "feature_evidence.json": "Feature evidence report mapping specific frontend files to feature requirements for scan/print reliability and strict prefix validation.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing their purpose, UI behavior, and functional responsibilities.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing prerequisites, dfx setup, production deployment steps, and troubleshooting for IC canisters.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens and dark mode styles plus global border/background settings.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app with authentication gate, tab navigation, wake‑lock indicator, and printer/protocol context providers.",
  "frontend/src/components/LoginScreen.tsx": "Touch‑optimized login component with backend health checks, auto‑retry, detailed error reporting, and authenticate flow.",
  "frontend/src/contexts/PrintProtocolContext.tsx": "React context for selecting and storing the active print protocol (CPCL/ZPL/ESC‑POS).",
  "frontend/src/contexts/UsbPrinterContext.tsx": "Provides a React context for managing WebUSB printer connections, handling device selection, interface claiming, errors, and sending CPCL commands.",
  "frontend/src/hooks/useActor.ts": "Builds and caches a backend actor based on Internet Identity, reinitializing when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication state, login, logout, and persisted identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend operations like authentication, printers, label configs, print records, and user profiles using the actor API.",
  "frontend/src/hooks/useWakeLock.ts": "Provides a hook to request and maintain a screen wake lock, handle release events, and reacquire on visibility changes.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme tokens, dark mode variables, touch optimizations, and tablet-specific tab sizing.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers and renders the root component.",
  "frontend/src/pages/Devices.tsx": "Manages USB printer connection, protocol selection, and sending a CPCL test print via WebUSB.",
  "frontend/src/pages/Diagnostics.tsx": "Displays print history and error counts and allows exporting diagnostic data to CSV.",
  "frontend/src/pages/LabelSettings.tsx": "Provides a UI for editing label layout settings, prefixes, and title mappings with live preview and saving to backend.",
  "frontend/src/pages/ScanPrint.tsx": "Implements two-scan validation workflow, error handling, and label printing using USB printers and stored configs.",
  "frontend/src/types/webusb.d.ts": "TypeScript definitions for WebUSB device, configuration, interfaces, endpoints, and transfer operations.",
  "frontend/src/utils/cpclTemplates.ts": "Provides CPCL label generation utilities, including test prints and dual-serial label rendering using the layout model.",
  "frontend/src/utils/icErrors.ts": "Classifies Internet Computer-related errors and produces user-friendly error messages.",
  "frontend/src/utils/labelLayoutModel.ts": "Defines label layout constants and computes precise dual-serial label layouts ensuring consistent preview and CPCL output.",
  "frontend/src/utils/labelPreviewRenderer.ts": "Renders dual‑serial label previews on a canvas using Code128 encoding and the unified layout model.",
  "frontend/src/utils/scannerOnlyInput.ts": "Detects barcode‑scanner input by timing keystrokes and normalizing scanned values while blocking paste and manual typing.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters with support for hash‑based routing and session storage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH-based color tokens, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing the project’s architecture, features, and issues for a barcode scanning and label printing web app backed by an Internet Computer canister."
}