{
  "backend/main.mo": "Main Motoko actor handling authentication, user profiles, label configs, printers, print history, error logs, and admin-controlled operations with password-based session auth and authorization mixins.",
  "backend/migration.mo": "Migration module converting old LabelConfig entries to the new extended format by adding default layout fields and returning an updated actor state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing behaviors and responsibilities of major frontend files for reference or documentation.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites, environment setup, and production deployment steps for the application on the Internet Computer.",
  "frontend/index.css": "Global Tailwind-based CSS theme defining light/dark mode variables and base layout styling for the frontend.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app component managing authentication, navigation tabs, wake lock status, and wrapping content with printer-related context providers.",
  "frontend/src/components/LoginScreen.tsx": "Login screen handling password input, authentication calls, backend health checks, and auto-retry logic with detailed error handling.",
  "frontend/src/contexts/PrintProtocolContext.tsx": "React context managing the selected printing protocol (CPCL, ZPL, ESC/POS) with a provider and hook.",
  "frontend/src/contexts/UsbPrinterContext.tsx": "Context for managing WebUSB printer state, connections, errors, and sending CPCL commands.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching the backend actor using the current identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hook for managing Internet Identity login state, loading stored identities, and handling AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks wrapping backend calls for authentication, health checks, printers, profiles, and other data.",
  "frontend/src/hooks/useWakeLock.ts": "Hook managing the Screen Wake Lock API, requesting and releasing locks and tracking support and state.",
  "frontend/src/index.css": "Tailwind setup defining dark theme variables and touch‑optimized styles for tablets.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/pages/Devices.tsx": "UI for managing printers, USB connection handling, and sending CPCL test prints.",
  "frontend/src/pages/Diagnostics.tsx": "Displays print history and error stats with CSV export and placeholder clear function.",
  "frontend/src/pages/LabelSettings.tsx": "Complex label configuration editor with Code128 encoding, layout controls, and preview logic.",
  "frontend/src/pages/ScanPrint.tsx": "Main scanning and printing workflow with barcode validation, audio cues, and dual‑label handling.",
  "frontend/src/types/webusb.d.ts": "TypeScript definitions for WebUSB API interfaces and transfer types.",
  "frontend/src/utils/cpclTemplates.ts": "Utilities for generating CPCL print jobs, including layout constants, barcode width estimation, centering helpers, and test/dual-serial label generation.",
  "frontend/src/utils/icErrors.ts": "Helpers to detect IC-specific, network, auth, and config errors and produce user-friendly error messages.",
  "frontend/src/utils/scannerOnlyInput.ts": "Utility for detecting barcode scanner input by keystroke timing, blocking paste, and normalizing scanned values.",
  "frontend/src/utils/urlParams.ts": "Functions to read URL parameters, persist them in sessionStorage, and clean sensitive params from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata and architectural notes describing the app’s features, backend structure, and known issues."
}