{
  "backend/main.mo": "Motoko canister implementing authentication, user profiles, label configs, printers, print history, error logs, and authorization helpers with password‑based session tracking.",
  "backend/migration.mo": "No-op migration module that maps old actor state to the new structure without transforming label or user data.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, and test references for layout and label configuration improvements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files including pages, hooks, utilities, and contexts.",
  "frontend/DEPLOYMENT.md": "Deployment guide with prerequisites, production setup steps, and canister management instructions.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theme variables, light/dark modes, and base styling overrides.",
  "frontend/index.html": "Minimal HTML shell loading the React application through main.tsx.",
  "frontend/src/App.tsx": "Main application component handling authentication, navigation tabs, wake lock status, and page rendering within printer-related providers.",
  "frontend/src/components/LoginScreen.tsx": "React login UI handling authentication, backend health polling, error states, and auto-retry logic.",
  "frontend/src/contexts/PrintProtocolContext.tsx": "Context provider storing the active print protocol (CPCL, ZPL, ESC/POS) with a setter.",
  "frontend/src/contexts/UsbPrinterContext.tsx": "Context managing WebUSB printer connection, device info, errors, and sending CPCL commands.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, stored identities, and auth client lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for authentication, health checks, printers, label configs, user profiles, and related mutations.",
  "frontend/src/hooks/useWakeLock.ts": "Hook managing screen wake lock activation, release, support detection, and visibility-based reacquisition.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, and touch-optimized styles with tablet-specific tab sizing.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/Devices.tsx": "Manages USB printer connections, protocol selection, and test printing with backend status updates.",
  "frontend/src/pages/Diagnostics.tsx": "Displays print history and error counts and supports exporting diagnostics data as CSV.",
  "frontend/src/pages/LabelSettings.tsx": "Provides UI for configuring label layout, prefixes, titles, and preview rendering with saved settings.",
  "frontend/src/pages/ScanPrint.tsx": "Handles scanning, validation, and printing of serial numbers with USB printer support and error logging.",
  "frontend/src/types/webusb.d.ts": "Declares TypeScript types for the WebUSB API including devices, interfaces, endpoints, and transfer results.",
  "frontend/src/utils/cpclTemplates.ts": "Utilities for generating CPCL print jobs, including test labels and dual-serial layouts, plus helpers for estimating barcode widths and centering text.",
  "frontend/src/utils/icErrors.ts": "Functions for detecting IC-related errors, classifying network/auth/config issues, and producing user-friendly error messages.",
  "frontend/src/utils/labelLayoutModel.ts": "Unified layout model for label previews and CPCL printing, including dimension constants, centering helpers, and dual-serial layout computation.",
  "frontend/src/utils/labelPreviewRenderer.ts": "Canvas renderer that draws dual‑serial label previews using Code128 rendering and the unified layout model.",
  "frontend/src/utils/scannerOnlyInput.ts": "Utility for distinguishing barcode scanner input from manual typing using timing heuristics and normalization.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters with session persistence and hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom OKLCH-based color palette, extended animations, and typography/container-queries/animate plugins.",
  "project_state.json": "JSON describing project state, including app summary, architecture notes for a React+IC system, and a list of known issues with backend auth and state handling."
}