{
  "backend/main.mo": "Main canister actor managing authentication, access control, label configs, printers, counters, logs, and print operations with migration support.",
  "backend/migration.mo": "Migration module converting old actor state to new format by removing v72LabelKey while preserving all other fields.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend files.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites, setup, and production deployment steps for the application.",
  "frontend/index.css": "Global Tailwind CSS configuration defining base styles, theming variables, and dark mode overrides.",
  "frontend/index.html": "HTML entry point loading the React application and mounting the root element.",
  "frontend/src/App.tsx": "Main React app component handling authentication, navigation tabs, wake lock status, and printer context providers.",
  "frontend/src/components/LoginScreen.tsx": "Login screen handling password auth, backend health polling, error states, and auto-retry logic.",
  "frontend/src/contexts/PrintProtocolContext.tsx": "Context provider storing and updating the active print protocol selection.",
  "frontend/src/contexts/UsbPrinterContext.tsx": "WebUSB printer context managing device connection, interface claiming, errors, and CPCL command sending.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hook managing Internet Identity login, stored sessions, status flags, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend calls for authentication, health checks, printers, profiles, and other data.",
  "frontend/src/hooks/useWakeLock.ts": "Custom hook requesting and maintaining a screen wake lock with auto-reacquisition and error handling.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables, dark theme overrides, and touch‑optimized styles for tablets and coarse pointers.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/Devices.tsx": "Manages printer devices including USB connect/disconnect, protocol selection, and sending CPCL test prints.",
  "frontend/src/pages/Diagnostics.tsx": "Displays scan/print statistics, recent print history, and allows exporting diagnostics as CSV.",
  "frontend/src/pages/LabelSettings.tsx": "Provides UI for editing label layout settings, previewing results, and managing valid prefixes and title mappings.",
  "frontend/src/pages/ScanPrint.tsx": "Handles barcode scanning, validation, serial pairing, and printing labels via USB or backend printers.",
  "frontend/src/types/webusb.d.ts": "TypeScript declarations for the WebUSB API, covering devices, interfaces, endpoints, and transfer operations.",
  "frontend/src/utils/cpclTemplates.ts": "Provides CPCL label generation utilities, including test prints and dual-serial label creation using unified layout calculations.",
  "frontend/src/utils/icErrors.ts": "Classifies Internet Computer errors and produces user-friendly messages for stopped canisters, network issues, auth failures, and config errors.",
  "frontend/src/utils/labelLayoutModel.ts": "Defines unified label layout calculations for barcodes, text, and titles, producing exact CPCL/preview coordinates based on config.",
  "frontend/src/utils/labelPreviewRenderer.ts": "Renders Code128 barcodes and full dual‑serial label previews on canvas using the unified layout model for CPCL-accurate output.",
  "frontend/src/utils/scannerOnlyInput.ts": "Detects fast scanner keystroke patterns, blocks paste/drop, and normalizes scanned text for reliable scanner-only input handling.",
  "frontend/src/utils/urlParams.ts": "Manages URL and session-stored parameters for routing, persistence, and secure cleanup of sensitive values from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, extended components (container, radii, shadows), and accordion animations, and enables typography, container-queries, and animate plugins.",
  "project_state.json": "Describes the app’s current project state, including version, architecture notes for the IC-backed barcode/label system, and a list of known issues in both frontend and backend."
}