{
  "kind": "build_request",
  "title": "Fix label preview to match CPCL print output 1:1 and keep settings synchronized",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Make the Label Settings preview and CPCL print generation use the same single source of truth for layout calculations so the Settings preview matches the printed label 1:1 (same centering, same X/Y positions, same barcode height/width scaling, same spacing/gaps).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ensure the label preview in Settings shows exactly how the label will look when printed (1:1 match).",
          "The preview and printed output must stay fully synchronized."
        ]
      },
      "acceptanceCriteria": [
        "Changing any label layout-related setting in Label Settings produces an identical change in (a) the Settings preview and (b) the printed CPCL output generated by the app.",
        "The preview’s dot-to-pixel transform is stable across re-renders (no accumulated canvas scaling/distortion after repeated adjustments).",
        "The same computed layout positions (in dots) are used for both preview rendering and CPCL command generation."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Fix layout centering and spacing so both barcodes are horizontally centered on the label when centering is enabled, and there is always a clear, non-overlapping gap between each barcode and its serial number text in both preview and printed output.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Adjust the barcode position so the barcodes are centered.",
          "Add a clear gap between the barcodes and the serial number."
        ]
      },
      "acceptanceCriteria": [
        "With centering enabled, both barcode blocks are centered horizontally in the preview and in the printed CPCL output.",
        "A minimum safe barcode-to-text gap is enforced for both preview and print output; if the user config would cause overlap, the effective gap is clamped and the preview reflects the effective (clamped) layout.",
        "Spacing between the first and second barcode blocks is also guarded so the two blocks cannot overlap in preview or print."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Ensure Label Settings position adjustments (barcodePositionX/Y, textPositionX/Y, barcodeHeight, barcodeWidthScale, horizontalSpacing, and any gap/spacing controls) are loaded from the saved backend LabelConfig, editable in the UI, persisted back to the backend on Save, and applied to CPCL printing (not preview-only).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "If I adjust the position of barcodes or serial numbers in Settings, those changes must be reflected on the printed label, not just in the preview."
        ]
      },
      "acceptanceCriteria": [
        "On page load, Label Settings initializes all layout controls from the saved backend label config (if present) rather than hardcoded defaults.",
        "After clicking Save Configuration, printing a label uses the newly saved layout values in CPCL generation.",
        "If centering is disabled, the printed and previewed barcode/text positions honor the user-provided X/Y values (instead of being re-centered)."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Update the unified layout computation to correctly respect user-configured text positioning when centering is disabled, and keep title/barcode/text X calculations consistent between preview and CPCL (avoid preview-only text width approximations that cause drift).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "When I try to adjust the barcode position in Settings, the preview shows something completely different from the actual printed label."
        ]
      },
      "acceptanceCriteria": [
        "When centering is disabled, text X (and any other position overrides exposed in settings) is taken from configuration and used consistently in both preview and CPCL output.",
        "Text and title placement in preview does not drift relative to CPCL output when changing zoom or repeatedly re-rendering the canvas.",
        "A regression check confirms that enabling centering re-centers both barcodes and their serial text consistently across preview and print."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui and other paths listed in frontend.immutablePaths must not be edited; compose those components instead.",
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; only add migration code if a stable-state schema change is required.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new print protocols (ZPL/ESC-POS) or changing printer connection/discovery behavior.",
    "Changing label size/dimensions (keep 48x30mm / 384x240 dots assumptions unless already configurable).",
    "Implementing new sound effects or scan-flow changes unrelated to preview/print synchronization."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}