{
  "kind": "build_request",
  "title": "Add per-prefix label counters (55V/55Y/72V) and serial-number text size setting",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Implement separate persistent counters for printed labels by serial prefix: 55V → “Dual Band”, 55Y → “Tri Band”, 72V → “New Dual Band”. Counters must be stored in the backend and not rely on frontend-only state.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Need counter for:\nDual Band which prefix is 55V\nTri Band which prefix is 55Y\nNew Dual Band which prefix is 72V"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes query methods to fetch each counter value (55V/Dual Band, 55Y/Tri Band, 72V/New Dual Band).",
        "Backend exposes update methods to increment the appropriate counter based on the scanned/printed serial prefix (55V/55Y/72V).",
        "Existing resetAllCounters clears all three counters.",
        "Counter values persist across page reloads (i.e., fetched from backend, not computed from local state)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Update Scan & Print so it increments and displays the correct counter based on the scanned serial prefix (first 3 characters): 55V increments Dual Band, 55Y increments Tri Band, 72V increments New Dual Band. The UI must show all three counters as separate tiles/cards (matching the existing counter-card style shown in the uploaded reference image).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Need counter for:\nDual Band which prefix is 55V\nTri Band which prefix is 55Y\nNew Dual Band which prefix is 72V"
        ]
      },
      "acceptanceCriteria": [
        "After a successful print with a 55V serial, the Dual Band counter increases by 1; 55Y increases Tri Band by 1; 72V increases New Dual Band by 1.",
        "Counters shown in the Scan & Print header are sourced from backend values (React Query), not only local component state.",
        "The Scan & Print counter tiles include: “Dual Band Labels”, “Tri Band Labels”, and “New Dual Band Labels” (English labels).",
        "The counters update immediately after a successful print (optimistic update or refetch) and remain correct after refreshing the page."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add a Label Settings control to adjust the serial-number text size, persist it to the saved LabelConfig, and apply it consistently in BOTH the label preview renderer and CPCL print generation.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Label settings need option to change text size for serial number."
        ]
      },
      "acceptanceCriteria": [
        "Label Settings includes a new control labeled “Serial Text Size” that updates the draft config and is saved with the existing Save Configuration flow.",
        "The saved LabelConfig’s existing `textSize` field is used for serial-number text sizing in preview AND CPCL output (no preview-only behavior).",
        "CPCL output uses the configured serial text size (e.g., changes the CPCL TEXT size parameter) for both serial lines.",
        "Preview canvas serial-number text visibly changes size when the setting changes and matches the printed output scaling behavior.",
        "Existing saved configs that have `textSize` set continue to load and render correctly; if missing/zero, a sensible default is applied."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Only create/update backend/migration.mo if an actual stable-state migration is required by the change.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not change authentication (including the hardcoded password) as part of this request.",
    "Do not redesign label layout/centering/spacing beyond what is required to support serial text size.",
    "Do not add new printer connection methods or real-time features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}