{
  "kind": "build_request",
  "title": "Fix Scan & Print auto-print reliability and enforce invalid prefix errors",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Fix Scan & Print so that after the second serial number is scanned and validated successfully, the app reliably auto-prints the CPCL label without requiring any manual Print action, including when the two scans happen very quickly back-to-back (no race conditions between the first-scan validation and the second-scan handler).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Is not printing automatically. Fix that."
        ]
      },
      "acceptanceCriteria": [
        "When protocol is CPCL and a USB printer is connected, scanning a valid first serial and then scanning a valid second serial prints exactly one label automatically without pressing the Print button.",
        "If the second scan occurs before the first scan’s async validation has completed, the app still auto-prints once both validations are complete (no missed auto-print).",
        "Auto-print does not trigger more than once per pair of serials (no duplicate prints).",
        "If auto-print cannot run due to protocol not being CPCL or printer not connected, the operator sees a clear toast explaining why, and the app does not attempt to print."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Enforce strict prefix validation for all scans: if any scanned serial number does not match an allowed/valid prefix, the app must show an error immediately and must not accept the serial into the workflow (no skipping prefix validation on backend errors).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Also if any serial number is scanned with not valid prefix show error."
        ]
      },
      "acceptanceCriteria": [
        "Scanning a serial with an invalid prefix shows a toast error with English text indicating the prefix is invalid and the serial field is marked invalid (red state).",
        "The invalid serial is not added to the scanned-serials list used for duplicate detection, and does not advance the workflow to the next field.",
        "The app does not silently allow scans when backend prefix validation fails; instead it shows a toast error indicating validation could not be performed (English) and logs a best-effort errorLog entry.",
        "Backend has a consistent configuration such that prefix validation can succeed by default (e.g., a default set of prefixes exists or validation has deterministic behavior when none are configured)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any other frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing text (toasts, banners, error messages)."
  ],
  "nonGoals": [
    "Adding new printer connection mechanisms beyond the existing WebUSB flow.",
    "Changing label layout/CPCL template formatting beyond what is necessary to restore auto-print triggering.",
    "Implementing new authentication providers or third-party integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}