{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Unify label layout computation for 1:1 Settings preview and CPCL output",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Make Settings preview and CPCL generation share one layout-calculation source of truth and ensure preview canvas scaling is stable.",
      "acceptanceCriteria": [
        "Changing any label layout-related setting in Label Settings produces an identical change in (a) the Settings preview and (b) the printed CPCL output generated by the app.",
        "The preview’s dot-to-pixel transform is stable across re-renders (no accumulated canvas scaling/distortion after repeated adjustments).",
        "The same computed layout positions (in dots) are used for both preview rendering and CPCL command generation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/labelLayoutModel.ts",
          "operation": "modify",
          "description": "Refactor the layout model so it fully defines all dot-based layout calculations (title, both barcode blocks, both serial texts, gaps, and spacing) as the single source of truth used by both preview rendering and CPCL generation."
        },
        {
          "path": "frontend/src/utils/cpclTemplates.ts",
          "operation": "modify",
          "description": "Ensure CPCL command generation uses only the unified layout model outputs (dot positions/sizes) with no separate/legacy centering or spacing logic, so CPCL output stays 1:1 with preview."
        },
        {
          "path": "frontend/src/utils/labelPreviewRenderer.ts",
          "operation": "create",
          "description": "Create a shared preview renderer that takes the unified computed layout (in dots) and draws to canvas with a stable dot-to-css-pixel transform (reset transform each draw, avoid cumulative scaling) to prevent distortion across re-renders."
        },
        {
          "path": "frontend/src/pages/LabelSettings.tsx",
          "operation": "modify",
          "description": "Update Label Settings preview to render exclusively via the shared preview renderer and the unified layout model; fix canvas rendering so it resets the canvas transform before applying devicePixelRatio scaling to avoid accumulated scaling distortion."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Fix centering and enforce non-overlapping gaps between each barcode and its serial text and between barcode blocks in both preview and print.",
      "acceptanceCriteria": [
        "With centering enabled, both barcode blocks are centered horizontally in the preview and in the printed CPCL output.",
        "A minimum safe barcode-to-text gap is enforced for both preview and print output; if the user config would cause overlap, the effective gap is clamped and the preview reflects the effective (clamped) layout.",
        "Spacing between the first and second barcode blocks is also guarded so the two blocks cannot overlap in preview or print."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/labelLayoutModel.ts",
          "operation": "modify",
          "description": "Update layout computation to (1) center both barcode blocks when centering is enabled, and (2) compute and clamp minimum safe barcode-to-text gap and inter-block spacing based on actual configured barcode height and text size, returning effective (clamped) values for both preview and CPCL."
        },
        {
          "path": "frontend/src/pages/LabelSettings.tsx",
          "operation": "modify",
          "description": "Adjust the Settings UI/preview to reflect effective (clamped) gap/spacing values when user inputs would cause overlap, so the preview matches the print-safe layout."
        },
        {
          "path": "frontend/src/utils/cpclTemplates.ts",
          "operation": "modify",
          "description": "Ensure CPCL generation relies on the unified layout model’s effective (clamped) positions and spacing values so printed output cannot overlap even with unsafe user inputs."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Load, edit, and save all label positioning/scaling settings from backend config and ensure printing uses the saved config (not preview-only).",
      "acceptanceCriteria": [
        "On page load, Label Settings initializes all layout controls from the saved backend label config (if present) rather than hardcoded defaults.",
        "After clicking Save Configuration, printing a label uses the newly saved layout values in CPCL generation.",
        "If centering is disabled, the printed and previewed barcode/text positions honor the user-provided X/Y values (instead of being re-centered)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LabelSettings.tsx",
          "operation": "modify",
          "description": "Initialize all layout controls (barcodePositionX/Y, textPositionX/Y, barcodeHeight, barcodeWidthScale, horizontalSpacing, and gap/spacing controls) from the fetched backend LabelConfig once it loads (handle async query updates), allow editing in the UI, and persist all values back to the backend on Save."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure label-config queries/mutations used by Label Settings and printing flow invalidate/refetch consistently after Save so subsequent prints use the newly saved configuration values."
        },
        {
          "path": "frontend/src/pages/ScanPrint.tsx",
          "operation": "modify",
          "description": "Ensure the printing flow consistently uses the latest saved LabelConfig from react-query data when generating CPCL, so adjustments made in Settings affect printed output (not preview-only)."
        },
        {
          "path": "frontend/src/utils/labelLayoutModel.ts",
          "operation": "modify",
          "description": "Extend the unified layout computation to honor user-configured X/Y positions when centering is disabled, using the saved LabelConfig as the authoritative input for both preview and CPCL generation."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Respect user-configured text positioning when centering is disabled and keep X calculations consistent between preview and CPCL without preview-only approximations.",
      "acceptanceCriteria": [
        "When centering is disabled, text X (and any other position overrides exposed in settings) is taken from configuration and used consistently in both preview and CPCL output.",
        "Text and title placement in preview does not drift relative to CPCL output when changing zoom or repeatedly re-rendering the canvas.",
        "A regression check confirms that enabling centering re-centers both barcodes and their serial text consistently across preview and print."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/labelLayoutModel.ts",
          "operation": "modify",
          "description": "Update the unified layout computation so that when centering is disabled it uses config-provided textPositionX/textPositionY (and barcodePositionX/barcodePositionY) directly, while centering mode computes barcode/text/title X using one consistent dot-based width model shared by both preview and CPCL."
        },
        {
          "path": "frontend/src/utils/labelPreviewRenderer.ts",
          "operation": "modify",
          "description": "Ensure the preview renderer uses the layout model’s dot-based positions directly (no independent text width measurement logic that can drift) and that zoom changes only affect the dot-to-pixel scale factor, not layout math."
        },
        {
          "path": "frontend/src/utils/cpclTemplates.ts",
          "operation": "modify",
          "description": "Align CPCL title/text/barcode X/Y usage strictly to the unified layout model output so preview and CPCL remain consistent when toggling centering and when applying manual X/Y offsets."
        },
        {
          "path": "frontend/src/pages/LabelSettings.tsx",
          "operation": "modify",
          "description": "Wire the UI controls so centering toggle deterministically switches between computed centering positions and user-configured manual X/Y positions, and ensure preview redraws from the same computed layout used by CPCL."
        }
      ]
    }
  ]
}