{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Scan & Print: reliable CPCL auto-print and strict invalid-prefix handling",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Eliminate Scan & Print auto-print race conditions so CPCL labels auto-print exactly once after two valid scans (even when scans are back-to-back).",
      "acceptanceCriteria": [
        "When protocol is CPCL and a USB printer is connected, scanning a valid first serial and then scanning a valid second serial prints exactly one label automatically without pressing the Print button.",
        "If the second scan occurs before the first scan’s async validation has completed, the app still auto-prints once both validations are complete (no missed auto-print).",
        "Auto-print does not trigger more than once per pair of serials (no duplicate prints).",
        "If auto-print cannot run due to protocol not being CPCL or printer not connected, the operator sees a clear toast explaining why, and the app does not attempt to print."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ScanPrint.tsx",
          "operation": "modify",
          "description": "Refactor the two-scan workflow into a small state machine that (1) tracks completion/validity of first and second async validations independently, (2) queues/holds a second scan that completes before the first validation returns, and (3) calls a single guarded maybeAutoPrint() function after each validation completes. Ensure auto-print is gated by CPCL protocol + USB connected, and is idempotent per (firstSerial, secondSerial) pair to prevent duplicates; if gated conditions are not met, show an English toast explaining why and do not attempt to print."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Enforce strict prefix validation for all scans; invalid prefixes or validation failures must error immediately and must not enter the workflow.",
      "acceptanceCriteria": [
        "Scanning a serial with an invalid prefix shows a toast error with English text indicating the prefix is invalid and the serial field is marked invalid (red state).",
        "The invalid serial is not added to the scanned-serials list used for duplicate detection, and does not advance the workflow to the next field.",
        "The app does not silently allow scans when backend prefix validation fails; instead it shows a toast error indicating validation could not be performed (English) and logs a best-effort errorLog entry.",
        "Backend has a consistent configuration such that prefix validation can succeed by default (e.g., a default set of prefixes exists or validation has deterministic behavior when none are configured)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ScanPrint.tsx",
          "operation": "modify",
          "description": "Update scan validation to be strict: use the existing prefixes data (via the existing query hook for prefixes) for immediate local prefix rejection when available, and ensure that any backend validation error (including missing/empty prefixes) results in an English toast error stating validation could not be performed, a best-effort addErrorLog call, and the scanned value being rejected (not added to scannedSerials, not advancing activeField, and not retained in internal refs used for printing)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the existing prefixes query hook is exported/usable in Scan & Print (and, if needed, adjust its enabled/retry behavior so the Scan & Print view can reliably know whether prefixes are loaded vs. unavailable, without changing any backend capabilities)."
        }
      ]
    }
  ]
}