{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Per-prefix label counters in Scan & Print + serial text size setting for preview and CPCL",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Update Scan & Print to fetch, display, and increment separate backend counters for 55V/Dual Band, 55Y/Tri Band, and 72V/New Dual Band based on scanned serial prefix.",
      "acceptanceCriteria": [
        "After a successful print with a 55V serial, the Dual Band counter increases by 1; 55Y increases Tri Band by 1; 72V increases New Dual Band by 1.",
        "Counters shown in the Scan & Print header are sourced from backend values (React Query), not only local component state.",
        "The Scan & Print counter tiles include: “Dual Band Labels”, “Tri Band Labels”, and “New Dual Band Labels” (English labels).",
        "The counters update immediately after a successful print (optimistic update or refetch) and remain correct after refreshing the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/adjust React Query hooks to read the three per-label-type counter values from the backend interface (using existing backend functions), and add a mutation to increment the correct counter based on a provided serial prefix; ensure related queries are invalidated/refetched for immediate UI updates."
        },
        {
          "path": "frontend/src/pages/ScanPrint.tsx",
          "operation": "modify",
          "description": "Replace local-only dual/tri counter state with backend-sourced counters (React Query) for Dual Band / Tri Band / New Dual Band; update the header tiles to show all three counters (matching existing counter-card styling), and on successful print call the increment mutation with the scanned serial prefix (first 3 chars) so the correct counter updates immediately and remains correct after refresh."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Add a “Serial Text Size” setting in Label Settings, persist it via LabelConfig.textSize, and apply it consistently in both label preview rendering and CPCL print generation.",
      "acceptanceCriteria": [
        "Label Settings includes a new control labeled “Serial Text Size” that updates the draft config and is saved with the existing Save Configuration flow.",
        "The saved LabelConfig’s existing `textSize` field is used for serial-number text sizing in preview AND CPCL output (no preview-only behavior).",
        "CPCL output uses the configured serial text size (e.g., changes the CPCL TEXT size parameter) for both serial lines.",
        "Preview canvas serial-number text visibly changes size when the setting changes and matches the printed output scaling behavior.",
        "Existing saved configs that have `textSize` set continue to load and render correctly; if missing/zero, a sensible default is applied."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LabelSettings.tsx",
          "operation": "modify",
          "description": "Add a new UI control labeled “Serial Text Size” to the existing Label Settings form; initialize it from the loaded saved LabelConfig.textSize (with a sensible default if missing/zero), update the draft config builder to use the chosen value, and ensure the existing Save Configuration flow persists it."
        },
        {
          "path": "frontend/src/utils/labelLayoutModel.ts",
          "operation": "modify",
          "description": "Extend the unified layout model to account for configurable serial text sizing derived from LabelConfig.textSize (including defaulting when missing/zero) so centering/position calculations can remain consistent as text size changes."
        },
        {
          "path": "frontend/src/utils/labelPreviewRenderer.ts",
          "operation": "modify",
          "description": "Update preview rendering to use the configured serial text size (from the computed layout / config) when drawing both serial-number lines so the canvas preview visibly scales and remains consistent with CPCL output."
        },
        {
          "path": "frontend/src/utils/cpclTemplates.ts",
          "operation": "modify",
          "description": "Update CPCL generation for dual-serial labels to use LabelConfig.textSize for the CPCL TEXT size parameter for both serial lines (with a sensible default if missing/zero), ensuring printed output matches the preview renderer."
        }
      ]
    }
  ]
}